{
    "id": "47003",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2013-01-07 20:45:45",
    "indent_level": 1,
    "content": "It's not anti-American at all. That's only what the title suggests. The Americans of today are the Brits of a hundred years ago, the Romans or whoever ruled the Empire.\n\nI try to look at things on an impersonal level, abstract, and I try to see patterns. That's all. No offense implied or intended. \n\nMy ramblings are not in any way complete either. I have looked at one side and I really concentrate on that side now. I strongly feel that we (as a people/species/society) are in a dead end and I think we need to look at alternatives. \n\nTo discuss communism with Americans, and I really beg you to not take offence either, is pretty hard. For <a href=\"http://imagefiction.blogspot.com/\" target=\"_blank\" rel=\"nofollow\">our good old friend Ted Byrne</a> the Nazis were a socialist bunch, not much different from the Soviets. I understand his view (and there is something to be learned from it), but looking at history, at Hitler's supporters in big industry, tells me a different story. Americans are obsessed with an idea of total freedom (that they themselves don't live any more), and every kind of control by the state smells communist to them. But then, your effort to get to the moon would have gone nowhere if left to the forces of the market. You wouldn't have won WWII with nothing but the power of the free market. Your corporations would have invested in Japan instead 😄\n\nDon't get me started on FDR. Roosevelt is an arch-communist in your value system of today. Even Eisenhower is left of Clinton. Nixon wouldn't make it into the primaries and Reagan wouldn't have a chance getting elected. Calling Obama a socialist is a dirty joke.\n\nI don't know what exactly Communism is. I know that it never existed and I am not sure if it ever can, if not human nature is too much against it. I know what it was meant to be and I intend to look at it, to find out what went wrong and why.\n\nHow can I do that? Better people than I have failed!\n\nBut then, I have the incredible power of hindsight. Everything is complicated when you are in the middle of it. Looking at it long after the fact might clarify things a lot.\n\nYes, there will always be strata, and the long history of socialism (as completely opposed to communism in its external form) took that into account. Socialism, that's what happened in Scandinavia, not in Russia, at least not in our diction. Even there some things went wrong, but overall Europe's northern countries are far better off than most of the world. It is not a black and white world. That's only what the Republicans preach.\n\nEducational levels in Scandinavia are consistently higher than in the rest of Europe and I believe in the US as well. Giving education for free and to all did not hinder anybody there.\n\nI am pretty certain that pure capitalism is not able to take a straight path to a better world. Its goals may sometimes coincide with the interests of the people, but in general it is just interested in perpetuating itself. In order to achieve great things (and to improve life for the general public is a great thing), you need some kind of overarching coordination, some purpose that is more than the will to amass money. Private enterprises can't and won't do that.\n\nThe reason why so many well-meant efforts have failed is the same reason why capitalism flourishes. It's not a general superiority of capitalism but a basic human fault, the way in which we all are prone to corruption.\n\nAnd as always I can only recommend Ursula K. LeGuin's \"The Disposessed\". It's what I always call the \"Doctor Zhivago\" of science fiction, a very political book, a book with a very balanced view of political systems, a book that could not be written today. It's kind of socialism on their moon and it's definitely hard capitalism on their earth. Both have their faults and there may be something in between. \n\nI am convinced that a goal is not discredited only because one effort to reach it has failed."
}
