{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2013-01-09 09:13:45",
    "indent_level": 4,
    "content": "Because the game is severely rigged. Take high frequency trading. It's a game open only to the richest of the rich, but it is extremely destabilizing, especially given how big its share of overall trade has become.\n\nFrom Wikipedia: <em>In the United States, high-frequency trading firms represent 2% of the approximately 20,000 firms operating today, but account for 73% of all equity orders volume (Aite Group Survey)</em>\n\nWhat this really means is, that a few super-rich are siphoning everybody's profits off <em>exactly without hard work</em> and <em>by spreading the risk to everyone</em>. Their profit, our risk. And if it does not work? Well, they let you bail them out. That's what happened during the last years.\n\nI'm not against hard working people like you getting their share and being proud of it. That's totally OK, I work for my money myself. \n\nI'm against excesses. I see a problem with the tricksters when it's also the tricksters who have the money to pay for laws that suit them. Again, the system is rigged.\n\nHigh frequency trading at best works like a mild tax flowing into the pockets of the rich. At worst it puts hard working people out of jobs - for no fault of themselves.\n\nGiven the danger to the general public, one would expect the government to step in, just like they do when they regulate car traffic with speed limits. They don't do it though.\n\nIt would be very easy: just tax transactions. Make the tax so small that it does not harm normal business, but big enough that it makes HFT unprofitable. Problem solved! Some people who don't work for their money have to go back to doing real work, 99.9999% gain a more stable and secure world. \n\nDoes not happen though. Wall Street pays corrupt politicians to make it not happen and therefore it does not happen, regardless how much sense it would make and how safe it would be.\n\nAgain, it's not about me trying to steal your iPhone, it's about bankers risking your job, and you not being able to do anything about it. Sure, you can work hard and find another one, as long as they don't decide to produce their goods in China and their software in India instead."
}
