{
    "author": "Flo (tonebytone)",
    "author_url": "",
    "date": "2011-11-17 16:38:44",
    "indent_level": 0,
    "content": "Roland, you rant is well timed. I've sent several protests. One of the organizations fighting this says that they have sent over 700,000 protesting petitions to Congress. One of the bills was stopped, but the vote was pretty close. Another bill is pending and who knows how that'll turn out.\n\nYes, the Hollywood - and other media bigwigs want to have their cake and control who else they'll share it with.\n\nUnfortunately, the U.S. is a hotbed of sedition of both the positive and the negative forces. The rich are trying desperately to hold onto their illegal and ill-gotten gains, while the rest of us, who are becoming poorer as they get richer, are now fighting back.\n\nIt isn't just the entertainment industry - it's also a battle in the medical field between the AMA-type of doctors in collusion with Big Pharma versus the alternative health care practitioners. \n\nThen there's the commercial huge farms industry in collusion with the FDA (which is supposed to protect the consumer, not the producers) versus the farmers and food producers and consumers who want organically grown and raised produce and products to be available so we consumers can have a choice.\n\nThe FDA has been quietly (meaning the mainstream media don't publish these incidents) raiding organic producers and shutting them down. One very famous cheese producer in Washington state has been shut down for 2 years, even tho they tried their best to correct all the \"violations\" of the food safety laws! They've had to sell their herd of prized cows.\n\nThe only way we U.S. citizens can find out anything is via the internet - and this is probably another reason why control of access to the internet is what this Hollywood copyright fight is all about. I think it's just a smoke screen to cover the real grab that the FCC, the FDA and all the other alphabet agencies who try to control stuff, want - total control of our access to the internet - worse, perhaps, than the present situation in China!\n\nI don't see anything wrong with how you have worded and linked to the music albums. But I'm sure some high-priced lawyer could find a loop hole or twist it around in some way.\n\nPerhaps you might consider using a mirror site hosted in another country, should this stupidity eventually pass."
}
