{
    "id": "6246",
    "author": "Flo",
    "author_url": "http://photos.tonebytone.com",
    "date": "2010-03-13 13:53:47",
    "indent_level": 0,
    "content": "Goodness, Andreas! I never expect my words to prompt such an outpouring of your philosophy. But thanks you for taking the time and effort to clarify what you mean.\n\nFirst of all there is no such thing as a working democracy. All governments all over the world are autocratic - in that they benefit only the rich before they think of benefitting the rest of us. Sure, there may be a leader (president, prime minister, chancellor, etc; who proposes laws) and a body of other people (representatives, supposedly OF the people) who can modify and act upon and create the laws; and a judiciary that's supposed to rule on the legality of the laws if anyone questions them.\n\nBut in real life, only the rich can afford to become leaders, representatives, judges - or one of the common people who agrees to obey the promptings of the rich in order for them to support him/her financially into office.\n\nAnd then we consider these same rich people who do control us via their laws: big corporations who have the money to publish other people's work - those people who are by no means wealthy enough to publish their own works - these corporation also set the rules by which they'll agree to publish someone's work. And if that person ever wants their works to be published, they must agree to these rules. Or starve.\n\nUntil recently - when some rich people have set up means by which people of modest means can actually publish a book - the publish-on-demand industry seems to be growing rapidly - but I think that even tho conditions are better for authors and artists who want to go this route, there are still restrictions imposed by the rich people who set up these alternative publishing facilities.\n\nWhat I'm saying here is that all these rich people got rich by parasitizing creative people's works. And until we can get these parasites off our backs, no one solution is going to take care of establishing fair and equal \"property rights.\"\n\nWe all have to rise spiritually so that we're motivated to \"do unto others that which we would have others do unto us.\" Then there will be no need for laws, as such. Agreements will be flexible according to the needs of each community and society at large. The rich will be motivated to share rather than to control.\n\nSounds like a pipe dream - but I do believe that some day this will come about - I hope it'll happen within my lifetime.\n\nUntil then, however, us \"common folk\" will have to figure out how to eject these parasites that manipulate markets to their monetary advantages. And you are so right about this. We have to convince the lawmakers that it isn't right to sit on a property that someone else has produced just to speculate that by making it rare, it will someday increase greatly in value when finally re-released.\n\nYou know what annoys me most about pro photographers? When they produce a print, they do it in limited editions. Say 50 or 100. This attracts only buyer who want to be exclusive, to have something that only a few others have, and to hang onto their purchases until demand for the print goes up so that they can make a killing when they finally decide to sell.\n\nThis is one set of circumstances. There is another in which, after the first 10 of a limited edition have been sold, then the photographer raises his price for the next 10 - and then he jacks up the price again for the next 10 and so on. The artist himself is creating scarcity in hopes of making even more money. People who do this can not complain about collectors and publishers who are basically doing the same thing.\n\nI would not buy anything from this type of photographer, even if I could afford his first asking price. I wish I had the money to support the photographers who issue open-ended editions and who do not make a practice of raising prices to create scarcity and demand. If costs go up, then certainly one should reserve the right to raise prices."
}
