{
    "author": "Andreas",
    "author_url": "",
    "date": "2008-10-22 13:48:00",
    "indent_level": 0,
    "content": "FJS, of course he is another good example 🙂<br/><br/>I think what most people are after, are simple, working solutions. <br/><br/>The problem is, that people at no time understood how things worked. In earlier times it was simply not known and there was no scientific analysis. Now there is, and for a long time we believed that progress and knowledge would eradicate these behaviours, but in fact it has not happened. We know more, yes, but at the same time the world has become unbelievably more complex.<br/><br/>In order to judge a solution, you have to have a deep understanding of the problem, but our problems are so complex by now, that we more or less have to believe what our scientists say. Honestly, who can judge quantum physics? Of course it is even worse with social sciences. Seen as sciences we attribute exactness to them, but they are never exact. You can \"prove\" pretty much everything without too much tampering with hard facts. Even the Nazi had sort of a pseudo-scientific base.<br/><br/>Populism is damn attractive because it provides simple solutions. The problem is, that even though they don't work, it is most of the time not obvious, and in some cases it needs a lot of scientific scrutinizing to prove that they don't work and why not. In many other cases it even can't be asserted, it is only highly unlikely that they could work.<br/><br/>Now take a someone without the means to verify one or the other, but with a strong yearning for the (often only perceived) simplicity of the past (before the immigrants came, before there were so many Jews in this town, before ...). Whom would he believe? The populist who speaks his language or the scientist?<br/><br/>People glorify the past, people believe that things that once worked will work again, people feel better when they can blame their misery to someone. The problem is that populism is so easy, and in any case much easier than constructive work."
}
