{
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2007-10-16 01:18:00",
    "indent_level": 0,
    "content": "Two people cannot ... ever... take the same picture of the same scene. In fact, I'm not certain that one artist  can take the same picture of the same scene twice. <br/><br/>Yep, it was terrific meeting up with Andreas. I am the proud owner of two Manessinger prints. Unfortunately my side of the deal,the prints of mine which Andreas ordered in trade for the two he brought along to Firenze did not arrive from the States until the following Monday, so I have schlepped them all the way back here to be mailed to Vienna later this week.In fact I intend to mail him three... the two he selected and a surprise which I printed for him.<br/><br/>I am overwhlemed with images. I shot between sixteeen and twenty gigs of RAW photos over the past two weeks. Andreas and I work quite differently. I learned photography as a photojournalist, and made an income later doing everything from weddings through sports... all of which demanded FAST shooting. I cannot abide a tripod. <br/><br/>Which is why we got separated last Sunday morning as he deliberately exposed his meticulous images and I machine-gunned ahead along the twisting ancient  streets in the predawn of Florence. <br/><br/>So... beyond the one image of the Duomo which I popped up onto my site before my lap top crashed - I have not yet even peeked at the perhaps hundred or so images from our morning shoot. And I think I will not for a while. Instead, I'm moving along a meticulous chronological path - just now investigating shots of Gondolfo and the small towns from the Albian Hills surrounding Rome. It's as if I'm visiting Europe all over again... <br/><br/>But at some point we shall have to combine our shoot into one display somewhere, eh? Andreas did not tell you all a secret. That glorious Sunday morning, just before dawn there was a crescent moon aglow in the sky above us that paired with either a glimmering bright star or satellite. I have no idea yet if I got them on pixels... Nor do I know if Andreas captured them as punctuation above the majesty of the structures. We shall have to see, eh? <br/><br/>BTW... this is perhaps the best portrait I've ever had taken. It looks the way I think I look... young, handsome, vibrant and outrageously virile. Doesn't it?"
}
