{
    "author": "Yechiel Orgel",
    "author_url": "http://www.bhphotovideo.com/",
    "date": "2010-03-18 19:43:52",
    "indent_level": 0,
    "content": "Dear Andreas,  \nMy name is Yechiel and I work on the Affiliate Marketing team at B&amp;H Photo. I’ve worked with hundreds of photographers and artists both amateur and pro, and helped them transform their passion into revenue. I had a chance to review your site in detail. Great Site! I believe that your site would be a great fit for our Affiliate Program.\n\nFor over 35 years, B&amp;H has been a leader in providing products and services to the professional photography and video industries. We have a national and international presence through our award winning website with over 200,000 visitors a day. I would like to propose a partnership between B&amp;H Photo and manessinger.com. It would involve some type of promotion (banners, links, virtual store, etc.) on your site.\nHere are a few reasons why thousands have joined our Affiliate Program:\n1. They turned their traffic into steady monthly revenue.\n2. Top Performing B&amp;H Affiliates earn thousands of dollars a month.\n3. Average order values well above most affiliate programs - averaging over $500.\n4. Commission payouts ranging from 2% - 8%.\n5. Affiliates have access 24x7 to track all account activity including sales and orders.\n6. Every B&amp;H affiliate is assigned a dedicated relationship manager to help you drive revenue and be an active partner in your success\n\nAbout B&amp;H\n1. Since 1973, B&amp;H has built its reputation on honesty, integrity, fair pricing, and superb customer service.\n2. We are the Professional Source for photo, video, pro-audio, computer, and home electronics products\n3. We carry over 250,000 products\n4. Consumer Reports rated B&amp;H a top 5 Electronic Retailer in 2008\n5. B&amp;H has been a winner of the BizRate Circle of Excellence Platinum Award for 7 Consecutive years\n\n\nTo learn more about our Affiliate Program:  http://www.bhphotovideo.com/find/affiliates.jsp\n\nTo view BHphotovideo.com: http://www.bhphotovideo.com/\n\nI am confident that we can add value to each other’s sites. Please feel free to contact me with any questions regarding our affiliate program. \n\nI look forward to hearing from you soon.\nBest regards,\nY. Orgel\nYechiel Orgel \nOnline Marketing Analyst \nBH PHOTO VIDEO  \n212 239 7500 ext 2785\nyechielo@bhphotovideo.com"
}
