{
    "id": "2577",
    "author": "Andreas",
    "author_url": "",
    "date": "2008-11-17 20:52:00",
    "indent_level": 0,
    "content": "Ahh, here we go again. Your assignment of left/right solely on an economic basis is wonderfully confusing to us Europeans 🙂<br/><br/>The funny thing is, I begin to believe that it is we who are wrong. Maybe the terms really don&#39;t make sense at all, at least not in that encompassing way that I mean them.<br/><br/>To make more sense, I propose the dichotomy totalitarianism versus democracy (with totalitarianism being my former &quot;right&quot;, OK?). This perfectly takes care of the seemingly paradox situation that the USSR in my view was a much more right than left régime, with only a bad sense of economy 🙂<br/><br/>There is even more to it. I freely admit that the factually existing capitalism is much more creative, inventive and productive than probably the most ideal communism could be, but actually I don&#39;t care so much about that. I suppose the area of greatest comfort is somewhere right of the middle (&quot;right&quot; now in your sense), and that race seems to be won anyway.<br/><br/>What I really care for is freedom. Freedom seems to be less endangered in a working democracy than in a totalitarian state. Freedom is the freedom to think, say and do as you like, as long as nobody gets hurt, with hurt being narrowly defined.<br/><br/>The overall tendency in western democracies has been towards freedom until the late 1970s, until the conservative backlash with Reagan, Kohl, Thatcher and Giovanni Paolo II. From then on we have been on a slide, with 9/11 giving us a strong push (Bush?) down.<br/><br/>The desire of the state to know everything about its citizens is totalitarian. The desire for control is totalitarian. Totalitarian and democratic are opposites, and it is the worst sin of democracies to yield to totalitarian tendencies.<br/><br/>Totalitarians come in democratic disguises, usually as the protectors of the beautiful and the sane, the rightful and God-given. That&#39;s why it&#39;s so hard to defeat them. They push their agenda with superficially perfectly reasonable goals.<br/><br/>Child pornography is such a thing. I have seen pornography on the Internet, but I can&#39;t remember having ever seen any incident of child pornography. Well, wrong, I have. That must have been more than 15 years ago. I used to automatically unpack everything that was posted in the Usenet news group &quot;alt.binaries.pictures&quot;. Most was porn, but part of it were nice background images. There I remember having seen a B&amp;W image of one or two obvious children involved in some sexual activity. I can&#39;t remember exactly.<br/><br/>That was it. Nothing else. I don&#39;t say it does not exist, but given the stance of our society against child pornography (and rightly so), wouldn&#39;t it be stupid of any producers to distribute it openly?<br/><br/>On the other hand, if this is traded in underground forums that you have to know about, at places that are not accessed by Google (a simple &quot;robots.txt&quot; file on a web server suffices to keep Google out), then there must still be ways how these things are advertised. It&#39;s a business after all. And if so, it must be easy for the police to infiltrate and invade those forums, right? I suppose they even do so.<br/><br/>Now tell me please: why would anybody need to take over total control of the Internet and the attached computers to fight child pornography? This is a business, no closed society. A business can&#39;t be closed, otherwise it would dry up. No customer has total control of the Internet, they still seem to find the vendors. <br/><br/>Ergo: Internet surveillance sounds beneficial, but it is not what it seems. The proponents of totalitarianism only use child pornography as a means to install a system that allows them to assert control.<br/><br/>Replace child pornography with terrorism and you see the same picture.<br/><br/>Yes, there were terrorist acts. I won&#39;t deny 9/11, Atocha and the London bombings, but, honestly (and cynically, I know): If you put those 4000 victims up against 100000 dead Iraqi, is that what you call justice? More so in the face of a government that completely made the &quot;Weapons of Mass Destruction&quot; story up, invented it, because they felt the need to react to an act of barbarism that was unprecedented and where it was completely unclear what a proper reaction could be anyway. Invented it, because they perceived reaction, any reaction, viable to their political survival. <br/><br/>Now, tell me, how cynical is that? You know you can&#39;t kill those who deserve it, so you kill someone else, just because you think the public deserves some killing to be done??<br/><br/>Those very same people are those who cleverly called a stupid act of self-weakening of democracy a PATRIOT act! There we have the disguises again.<br/><br/>Let&#39;s look at totalitarian régimes of the past. Regardless of their position on a left/right scale, they surprisingly all have a comparably small group of profiteers, people who are in control or very near the center of control, and who are much better off than everyone else, and I mean that in a very economic sense. The USSR had them, the Cubans have them, China of course, modern Russia, and in unrestricted capitalism we tend towards an oligarchy of the rich.<br/><br/>These are the supporters of totalitarianism. Why? Profit! It&#39;s so simple. Cui bono, eh?<br/><br/>One of the strengths of a truly democratic society is its ability to change, to adapt. Totalitarianism abhors change, puts shackles around everything that threatens to move, but in order to do so, it needs control. It&#39;s not a very clever thing to do for a democratic society to install an infrastructure that is in principle totalitarian and that will only rise to its full strength under totalitarian rule. It&#39;s a bit like forging the sword that will cut your throat.<br/><br/>As regards the Obama landslide, well, I think it&#39;s perfectly democratic to always want one side to win, but it&#39;s also perfectly democratic that from time to time the other does. If anything, then this may be the essence of the democratic process. What else?<br/><br/>Other than that, I completely agree with you 🙂"
}
