{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2010-01-26 10:58:28",
    "indent_level": 0,
    "content": "Thanks all.\n\nTed, yes, there is an inherent melancholy bias in monochrome images, but it's only an uphill struggle if you're trying for a cheerful, light mood. It works pretty well for many kinds of images. Take my recent \"low down\" image \"<a target=\"_blank\" href=\"http://manessinger.com/2010/01/1194-dirty-world.html\" rel=\"nofollow\">1194 – Dirty World</a>\". Ove has commented \"<i>Oh my god, I thought you had entered a war zone here</i>\", and I dare say that this image seems to work as intended 🙂\n\nAnd yes, monochrome is often an easy way out. There are cases where the information that I want to share, is not in the color. It's in tonal values, shapes, lines, and sometimes there is a distracting patch of for instance red color right at the edge of the image, a color that would attract much attention to a spot where I don't want it. What can I do? I can edit it out (I do that often), I can use something like Alien Skin Bokeh to blur it away (you do that often), or, and that's the easy way if there is nothing of what I want to say in the color anyway, I can go for b+w.\n\nThis very image is a case where I was presented with the problem of having seen a blinding light in reality, but the camera captured it much darker. I couldn't have changed overall exposure, because then I would have lost all details. Thus I had to selectively increase exposure in some highlight regions, restoring a feeling of contrast.\n\nI've done that in the color version, and in fact the strong saturation that I've added, gave that run-down spot under the bridge an almost cheerful mood, very similar to what I experienced when I was there. On the other hand, the hard contrast didn't come over that well. Thus, like so often when I am not sure what I want to do with an image, I tried b+w, and whenever I try b+w, I step through the various filter presets in the Photoshop b+w adjustment layer.\n\n\"High Contrast Red\" had much of what I was looking for in terms of contrast, but the gloomy look of \"High Contrast Blue\" immediately fascinated me. Combining them with masks was an experiment, and the result satisfied me, because it was somewhat complementary to what I had achieved in color.\n\nIn a way both versions, color and b+w, represent aspects of the scene, aspects that were there, aspects that I can't combine into one single version. And that is not even a problem, it's a feature. You can look at reality in different ways. You can choose to ignore this or put your attention to that. That's what we do all the time. We see, and most of what we see, we ignore immediately and completely. It's our way of making sense of our environment, it's our way to cope with information overload.\n\nPhotographing in RAW gives me the opportunity to delay much my decisions until post-processing, but sometimes even that is not enough. Sometimes I want to share two different views, and that's what happened here."
}
