{
    "id": "2273",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2008-07-08 20:15:00",
    "indent_level": 0,
    "content": "Lewis,<br/><br/>Thanks for the compliment. Much appreciated 🙂<br/><br/>So what did I study? Probably the most important source is <a HREF=\"http://www.radiantvista.com/\" REL=\"nofollow\">The Radiant Vista</a> and Craig Tanner's \"Daily Critique\". Well, it's not so daily any more, and at the moment there is only one issue online for free download, but Craig's critiques are easily the best thing you can get. Sure, they reflect the judgment and taste of one particular photographer, but firstly it's a damn good one, and secondly the big gain lies in hearing him reason about images. Do yourself a favor and dig into that resource.<br/><br/>They used to have extended download access in their shop, but obviously something is going on. Maybe they open up their archives for free again. I don't know. In any case I'd follow the site.<br/><br/>As regards books, I have read a lot, but I'll recommend only one: Freeman Patterson's \"<a HREF=\"http://www.amazon.com/Photography-Art-Seeing-Freeman-Patterson/dp/1550130994\" REL=\"nofollow\">Photography and the Art of Seeing</a>\". It's less about technique, it's more about openness and letting things happen, much like Craig's teaching.<br/><br/>Well, that's it. The rest is work. You can't make good images without making images. Go out, do it, expect to get better with practice, but don't ever expect to be satisfied with your skills. At any stage there are things that you can't yet do, although you already can imagine them. That's a good thing 🙂<br/><br/>Regarding shallow DOF, no, our eyes don't see like that. Human eyes have very much depth of field, and the way the brain uses the raw information from the eyes further increases the perceived DOF. Have you ever noticed how your eyes are always in motion? Sampling one point and then the next? Constantly adjusting focus all the while? That's one of the reasons.<br/><br/>Believe me, when you think that my image of today looks natural, then you are victim to the exact phenomenon that I have written about. Maybe I should suggest Susan Sontag as further reading?<br/><br/>Thanks, Andreas"
}
