{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2014-04-09 07:05:39",
    "indent_level": 1,
    "content": "Well, I come from a long Unix history. Utrix, Digital UNIX, AIX, HP-UX, SCO, Interactive, BSD and finally Linux. I always hated Windows and somehow admired MacOS, but found it too expensive. Today I see Linux getting bloated and constantly losing functionality. Gnome 1 with Sawfish ist still the best window manager I ever used. Since then virtal desktops have deteriorated. 12 years ago I used to have three virtual desktops with 6x5 viewports, [ctrl]-[alt]-LRUD mapped to move the viewport around the planar current desktop, [ctrl]-[alt]-[PU/PD] mapped to change \"up\"/\"down\" between Desktops. Normally I worked on the middle plane. From every non-corner viewport I had to use only one command to reach six neighboring viewports. Stability was great and I could keep such a session open for months without rebooting.\n\nWell, that was that. This desktop setup was made possible by the Gnome 1 pager, but obviously my setup was deemed so exotic, that no pager after that supported it. Today you have to feel lucky if proper planar navigation is supported, with plenty window managers giving you linear movement only.\n\nMy photo hobby has pushed me to Windows, the whole industry being to blame, with Adobe being the worst culprit. I still run Windows 7 and I find it extremely stable (for a Windows) and, with \"dexport\" as virtual desktop, pretty usable as well. As my programming work has entirely shifted to portable languages, I can also easily work on Windows. It's OK.\n\nThat leaves Mac OS X. I still can use my laptop, a 1.5 kg Sony Vaio Z21, upgraded to Windows 7 and 8GB. Every once in a while I look what the market offers, and at the moment I would like a laptop with 16GB, a 512 GB SSD, a display usable for critical photograhic work, and no more weight than my current device. Guess what, not only the cheapest, but also almost the only system on offer is a Macbook Pro 13\" with retina display. At 1.6 kg it is only slightly above my weight limit and I would tolerate that. Crazy, huh?\n\nOn the Windows side I see Windows 8 (almost as usable as Windows 7 if you invest a day), bad driver support (my Vaio's card reader was only supported on Vista/32!) and everything around my desired specs is at least as expensive as an Apple or simply not to be had.\n\nBut then, my Vaio still works 😄"
}
