{
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2008-03-30 04:00:00",
    "indent_level": 0,
    "content": "Wait…. Wait…. WAIT!!!!!<br/><br/>I don’t care what  beauty is. Nope… I just care what it is for!<br/><br/>Do any other animals  notice it? Hmmmm… well,  yeah.  Apparently male birds, for example,  preen and girl birds go… WOW!<br/><br/>But do they look at mountains against the sky and go…. “WOW!”?<br/><br/>I think that beauty is hard wired to an evolutionary function. And since the primal function is producing more  of us… I’m guessing that beauty’s related to that. Although frankly, I DON”T CARE!!! <br/><br/>Beauty’s one thing that gets our attention . And things that get our attention are “for” something. They’ve got a utility. A function. <br/><br/>I’m just sayin’ that there are a whole bunch of pretty/beautiful photos that really don’t do anything else. They are not a portal to anything. You go “WOW!” and you never come back. That kind of beauty is deep as a parking lot puddle in August. - and as lasting. The word “shallow” comes to mind. Well, to my mind anyway. <br/><br/>I think an arresting result without meaning is pretty crafty. In fact it can take reeeeeeely, reeeeeely, reeeeeeely HIGH craft to pull off. <br/><br/>We aren’t as distracted by the size-babes of 1670. I agree that the definition of what’s pretty is a moving target.  So’s J-Lo’s, um…. bottom. And for the moment, there’s a great deal of agreement that Jenny From The Block’s a current answer for a lot of people asked about beauty. <br/><br/>At the risk of redundancy….  It doesn’t matter to me what beauty is…. I don’t care… Nope, I’m fixated upon what it’s for. Artists have exploited it for centuries… Millennia ….  To do what? <br/><br/><br/>I’m just askin’… What are you doing when you make beautiful pictures? What is your conscious or unconscious intention? What do you want from us after we go “WOW!”? Is that the end in itself/ Izzat all there is? I don’t want it to be…. <br/><br/>Hmmmmmm???? <br/><br/>BTW... Sorry I deleted my original post... I found a big stupid typo that stood out like a pimple on the nose of a great... beauty!"
}
