{
    "author": "Flexx",
    "author_url": "",
    "date": "2007-03-04 04:50:00",
    "indent_level": 0,
    "content": "I viewed this image after reading your lament about not getting any comments on it in the following day's post, then read the narration on this image. BTW, now I know why you got yourself that 30/1.4 -- would have been tricky to frame your own hand held though the bars with a telephoto lens in the other hand. But then again, it would have looked so stupid that it had drawn the attention of potential hand donors to the scene. But we know there's more than one way to do it... 😉<br/><br/>Anyway I decided to spice up your stats a bit, so here we go:<br/><br/>Upfront: This is not one of your best images IMHO, not because it's not a good photograph, but because you lay the bar quite high with what you produce on other days. Technically I don't see any problems, except maybe a slight overexposure on the back of your hand, and it being somewhat magenta-ish but that might as well be my ill-calibrated CRT.<br/><br/>But the image doesn't really convey your intention. A you wrote yourself, none of those you asked had any impression of imprisonment when looking at the image, neither did I, not even after reading the story going along with it. Why is that?<br/><br/>First, it isn't obvious you're reaching through the fence. Also, when imagining a captive trying to reach out, we'd not just see a hand, we'd probable see the whole arm being stretched though the bars. The hand also does not grab at anything, in fact it looks more like the fingers where stretching instead of grabing. It's easy to realize this shot was taken at the streets and not in a prison setting, the base of the bars just doesn't look like one would expect from prison bars. They're decorative, not functional. Aiming higher, and omitting the stone altogether might have worked better towards your intention. Another thing that spoils the \"reaching though\"-notion is that the little finger is at the opposite side of the bar as the rest of the fingers. You wouldn't do that naturally if you wanted to reach out through the fence, but you're not grabbing the bar either. This is disturbing me, BTW, regadless of the intention you described. I can't say why but I dont like it, it's just arkward.<br/><br/>All in all, it's a good idea for a shot, that simply fell a bit short because you had to use your own hand, and anyone who's tried to use one's own bodies' parts in a photo knows it's not easy to do and most of the time doesn't work out. So, if you care to try the shot again, I'd be glad to lend a hand... 😉<br/><br/>Cheers,<br/>Flexx"
}
