{
    "author": "Cedric Canard",
    "author_url": "http://aplop.wordpress.com/",
    "date": "2012-02-12 10:31:01",
    "indent_level": 0,
    "content": "I have spent a number of hours reading the various blog entries, comments and links around this topic and it has been most interesting. Discovering Gary Woodard even more so.\nMark Hobson's posts are often in themselves emotionally charged and his view was well in character and as thought provoking as ever.\nYour view Andreas is, as always, more balanced, at least to my eye.\nFor me any photo of any subject has the potential to charge me up with emotions, whether the images in question be abstract, landscape, street, portrait or whatever. It's simply a question of what memory they will trigger. Having said that, there is no doubt that the odds of getting emotionally charged by a photo increases many fold if people are involved. In such cases empathy comes into play and that is quite a powerful force (marketers make great use of it).\nHowever no one really asked what Mark meant by \"emotionally charged\". The photo on his post and the examples given–family portrait next to mother's coffin–suggests that perhaps he is only looking at one side of the emotional spectrum. In that case I think there are plenty of reasons why few people do that kind of photography and these are not just the reasons given by Craig Tanner. When we're talking about documenting life's tragedies most of us are preoccupied with the more pressing situation of the immediate moment. Even if the situation does not directly involve us, empathy can put us right in there and which f-stop to use becomes the last thing on our mind.\nThis is not to say that every one is like that. Thankfully there are people out there, such as Mark by the sound of it and Gary Woodard too, who can distance themselves from the situations just enough so that they can photograph them and then share them either through blogs or through books, magazines and newspapers. I say thankfully because I see a need for this kind of documentation of humanity. It reminds us that life's biggest problem isn't the latest change Zuckerberg made to Facebook or that an earthquake in Japan delayed the arrival of the X100 camera.\nAnyway, I would suggest that most amateur photographers shoot out of a particular personal need and I suspect many shoot out of a need to connect with something quiet and calm as an antidote to their already emotionally charged lives. Craig Tanner is right, I feel, about the benefits of overcoming fears and the joy that can be had in photographing strangers in the street but that is quite different to photographing the \"emotionally charged\" situations that I think Mark is talking about. There would be nothing gained in forcing yourself to photograph such events. If the need to photograph such events doesn't arise then don't; odds are you're already emotionally charged as are the people around you. In such situations you have nothing to prove to anyone."
}
