{
    "author": "bob",
    "author_url": "",
    "date": "2011-01-02 16:42:06",
    "indent_level": 0,
    "content": "My style of shooting is to try and capture the moment (Whatever that might be). For that, fussing with the camera becomes a distraction. I want to be able to see the moment through the viewfinder and press the shutter release. Obviously this is not going to happen any technological time soon. I moved from an Olympus OM1 (All mechanical 35mm) to the D80 with 18-200mm lens. The lens was selected to reduce fussing with changing lenses as on my OM1. Low light and high speed soon came to be a problem somewhat relieved with the acquisition of large aperture 28, 50, 85mm lenses but now I was back to fussing with lenses. The D80 exposure and focus where never good enough for me and have remained an irritant.\n\nBut the biggest limitation of the D80 compared to my OM1 has been, seeing the moment through the viewfinder. The old OM1 just smokes the D80. For some reason the camera vendors refuse to give a large image through the viewfinder. (I even bought the viewfinder magnifier, only minor improvement). They want us to buy the full frame cameras just to get the better viewfinders. So, I have given in, and am waiting for the a full frame camera that does proper video (I also have a video camera). The prime lenses mentioned earlier were all chosen to be full frame. I'm expecting my low light, focusing, and exposure issues to also be resolved. I suspect they will fail on the exposure issue. To fix the exposure they need to do what I now do in Photoshop, and that is reduce exposure to fix blowouts and compensate for under exposure by changing the gamma. This results in increasing the dynamic range, at the expense of noise in the low value areas of the photo.\n\nMost people don't seem to understand what I mean by viewfinder limitations. Just pick up a reasonable pair of binoculars and compare their image to that available in any camera viewfinder. I want what I get from my binoculars in my viewfinder. That is what I consider adequate."
}
