{
    "id": "1473",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2007-06-24 08:41:00",
    "indent_level": 0,
    "content": "Socializing helps spread the message? Who would have thought it 🙂<br/><br/>Welcome to my blog!<br/><br/>@Andreas: Danke. Craig war etwas konfus gestern. Macht nichts, ich war letzte Weihnachten auch schon mal \"Andreas from Sweden\" 🙂<br/><br/>@Faye: Goodness! How many blogs can one person have 🙂 Welcome!<br/><br/>@Chad: I see you often on Ted Byrne's blog, but I didn't follow the link until recently when I found that you have stopped blogging, hopefully only for now. <br/><br/>@pnfphotography: (you really don't want to disclose your name, do you?)<br/><br/>Don't worry, many people on the Internet have a profound education in computer science, I for instance have a degree from university and make my living writing computer programs, mostly revolving around web technology. It would be embarrassing if I didn't know, for you it's absolutely OK. In order to show you how to create links, I have set up a little comic <a HREF=\"http://i11.photobucket.com/albums/a174/ADVMAN/Forum-threads/how_to_link_on_blogger.gif\" REL=\"nofollow\">here</a>.  Download the image and keep it open while reading on.<br/><br/>Let's begin with the upper left image. I suppose that when you create a posting, you are normally in \"Compose\" mode. The other mode would be \"Edit HTML\", and you switch between the two by clicking one of the two tabs above the edit frame. <br/><br/>Creating a link begins with selecting the part of the Text that you want the user to see. In my case it was the word \"Trigonale\". Then you click the icon that I've marked, the one that is probably meant to symbolize planet Earth with two links of a chain overlaid (don't laugh, that's really what this icon means. It's the World Wide Web after all). Clicking the icon with a selected word active  opens a dialog window that's shown in the next image.<br/><br/>In this dialog, where it says URL,  you enter the address of the target page, the page that you link to, the page that should be in the browser <b>after</b> the user has clicked your link. URL is tech-speak. It means \"Uniform Resource Locator\" and is just a fancy name for a web address. I do this normally by having the target page open in another window. When I click into that window's address line, I can highlight the address and copy it into the dialog. For long addresses this is more convenient and less error prone than typing. When you have entered the address you click \"OK\". As a result you already have a link, but we want to refine that now. In Order to do that, we need to be in \"Edit HTML\" mode. See the third image for how the two tabs above the edit frame have to look like.<br/><br/>In the fourth image I have marked how the link looks like in HTML, the mother-tongue of the web. This \"&lt;a&gt\" thingie is called an \"anchor tag\", because it anchors the link in your page.  Tags can have attributes, some of them are mandatory. The anchor tag has one mandatory attribute \"href\" that contains the target web address. You see it in the image.<br/><br/>We want to add another attribute. You see it in the last image. Its name is \"target\" and its value is \"_blank\". This tells the other user's browser to not replace your page with the target page, but to instead open it in a new, blank page. I do it always that way. Not all users like it when links open in new windows, but from the author's point of view it's a good thing. You don't lose the user to the target page, your original page is still there.<br/><br/>Does that make sense?<br/><br/>Andreas"
}
