{
    "id": "4659",
    "author": "Sven W",
    "author_url": "",
    "date": "2009-11-28 13:11:45",
    "indent_level": 0,
    "content": "Hi Andre, I enjoy looking at your images and do wonder sometimes at the level of post-processing (more in awe than disapproval 🙂 ).\n\nI agree with Paul Maxim and what I think Techfan is saying. In fact, I'll take Techfan's comment a little further and say that one of photography's unique abilities is that it can capture something closer to reality than any other medium. Given this ability, one photographic pursuit would be to capture images that say something about the real world.\n\nI believe many people expect this of photography and don't like to be fooled by an image that \"looks real enough\" but is a fiction.\n\nAs a [amateur] photographer I look at an image from two points of view. Firstly the art and skill required to capture the image with a camera and secondly the art and skill of post-processing.\n\nIf the image is 99% camera work then it's a photograph. Otherwise it's a photo-illustration. The \"99%\" is a contrived number but I use it to make the point that a \"true\" photograph has minimal post-processing.\n\nEach photographer has to decide where the 99% line is for their work and even on a per image basis. One of the key questions for positioning the \"line\" is this: does the editing change the meaning of photograph?\n\n[There's a similar issue when taking the shot in the first place, but that's another story 🙂 ]\n\nIf an image has been edited and it's meaning has changed (\"The Man that Got Away\" is an example) then I would prefer this is disclosed. Even a discrete tag that says \"photo-illustration\" would suffice.\n\nThere's another reason for disclosing the nature of an image. Perversely, I have friends who look at my \"true\" photographs and ask if they are real -- when they were present when I took the photograph! People can look at a true image and not be convinced [in their own mind] it's the real thing. Part of the problem here is their photograph is poorly composed and so they regard my well composed image with suspicion."
}
