{
    "id": "43668",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2012-02-27 11:37:19",
    "indent_level": 1,
    "content": "Oh yes, I did 🙂\n\nThe problem is, that I wanted to capture the swans while swimming through the reflections of the sun. This makes for interesting, metallic water, but it also makes for extreme contrasts. What you get out of the camera is an image with nice water and a mid-to-dark gray swan. Obviously that's not what you want 🙂\n\nBasically you need all the dynamic range you can get, which means you need to work in RAW. In Adobe Camera RAW I first set exposure values to automatic, and then I turn the blacks pretty down to zero, contrast very low, sometimes in the negative values, and instead I increase brightness. I also use a flat contrast curve. The idea is to get the swan as bright as possible and to have as much of the recorded tonal values in the histogram.\n\nI don't do any noise reduction or sharpening in ACR. For noise reduction I always use Topaz Denoise, for sharpening a Luminance layer with Unsharp Mask 0.3px, 500 strength and zero threshold. Normally I blend it softly between 128 or 192 and 255 (sharpness layer) and between 0 and 63 or 128 (layer below). The effect is, that the sharpening is reduced in originally darker regions and that extreme highlights in the sharpening layer are blended in softly.\n\nFrom here I may add highlights with an exposure layer (for instance 0.5 EV on all or parts of the swan), add back saturation and contrast, but layer by layer, mostly using masks.\n\nI may also blend in photo filters where the extreme highlights gave the image an unwanted cast. You may find that half of your image has a yellowish cast that you want to correct. Extreme sunlight tends to make color pretty random.\n\nThere's no fixed formula, but most of the time it's something like that. It sounds complicated and tedious, but when you know what you're doing, it takes maybe 15 minutes for an image."
}
