{
    "author": "Craig Tanner",
    "author_url": "",
    "date": "2008-07-04 13:54:00",
    "indent_level": 0,
    "content": "Hi Andreas,<br/><br/>Great post. First, thank you for the inspiration of your blog and your beautiful photography. I mostly lurk but when I do I am always rewarded.<br/><br/>I can't agree more with you here. I have a whole section of a talk I give titled from Ordinary to Extraordinary and that section is titled Productivity equals Creativity. In that part of my presentation  I show the sheer volume of productivity from which  the images of mine that other people find to be my most creative work come out of. In one editorial cover shot job (that went on to be used by Singh-Ray  in national ads) I took over 1500 pictures at three different locations and the final shot literally came from nowhere... in other words its not an image I previsualized... it just appeared out of the process of being productive just as you describe here.<br/><br/>When people take in that part of the talk, for some a light bulb goes off. They can see that the shot came, not from a fully formed special idea that I had in my  head all along.... it came randomly out of being involved in the process.... when people start to see this is how it works they hopefully start to believe in themselves. <br/><br/>Lot's of people who are just getting into photography still believe that the reason some people are getting great shots is because of some magical special something that other people have. We are the same... creativity comes out of nothing. We all start at the same place. Its the folks that are willing to keep starting with and working with nothing who most often end up with something that they and others call \"creative\" in the end.<br/><br/>So to me the question is how to be more productive. People talk about inspiration like its some gift from outside of us. In my opinion inspiration is nothing more than a conditioned choice which is driven by a belief system. If you think you have to go the Grand Canyon to be inspired then your creative life is going to look pretty damn bleak.  The older I get the more I work on cultivating a belief that every single moment and everything I see is a miracle. And because of that growing belief I spend more time working to grow my eye and my craft so that I can photograph anything, anywhere, at anytime. That is a choice.... it is a habit. So its always time to get on with it.<br/><br/> If as an artist you aren't doing that then take a long hard look in the mirror. This is not about saying yes to some something out there. This is about saying yes to yourself. <br/><br/>Some people get pissed off at me for talking about the rules of photography when I do my daily critiques on RV... well I'm just talking about design and if you don't have the big boy pants to handle that then God help you... but here is one rule I am deadly serious about and if you don't follow it your art and creativity will be f____d for all time and it comes from John Cage's (Composer) ten Rules for being more creative....<br/><br/>RULE SEVEN: \"The only true rule is work. If you work it will lead to something. It's the people who do all of the work all of the time who eventually catch on to things\"..... Amen !!! <br/><br/>Thank you again Andreas for the inspiration of showing us the fruit's of all of your hard work here.... Craig"
}
