{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2012-05-27 18:56:26",
    "indent_level": 1,
    "content": "I think the main problem is, that the whole world's economy converges against the US system: Everything is privately owned and controlled, everything is operated for profit and, more so, is expected to do so. That's the result of 30 years of conservative backlash. They've worked hard to get it into our minds, and now that it is there, it's extremely hard to overcome.\n\nI absolutely accept that art is fostered by commercial success. When you make art to an extent that you can't possibly do it without doing it full-time, you're better in a position to be able to make your living that way.\n\nOn the other hand, it's not about the artists. Asimov is dead. Admitted, his second wife still lives and so do his sons, so maybe there's even a case for the protection of an author's work after his death. Maybe.\n\nBut then: once something has been published, it becomes part of our shared history. Asimov told his stories, but it were our dreams that were fueled by them. We have a strong interest in having those stories available.\n\nCopyright protection originally was a deal between the author and the public. An author got protection (and the society spent tax money on that) and in return he made his works available. It's two sides: we grant them a temporary monopoly (currently for much too long), gaining the availability of our cultural heritage.\n\nIf they don't keep to their obligations, why should we keep protecting them? And really, THEY are not the authors, THEY are the publishers and all the other parasites that once had a function and now, in a digital age of direct distribution, cease to do so.\n\nThe problem is exactly that the capitalist mind does not accept the idea of cultural heritage. They see no obligations on their side, and in a weird and convenient partial blindness they funnily expect us to keep to ours.\n\nIt's often said that the market is the solution to all problems. Don't regulate and the market will do the right thing all by itself. \n\nThat's plain wrong. The market is completely unable to achieve great things. The Americans were on the moon, not because the market brought them there, but because a strong, central government was in place and because it could wield the threat of war and the baton of national pride. No market anywhere.\n\nGeneral availability of our cultural heritage to the public is a greater good and the capitalist does not believe in greater goods. It would need a radical shortening of copyrights and a strict two-side deal between public and authors. It would maybe need a state-operated (or better internationally operated) infrastructure to achieve this. Tell that to a Republican or one of our so-called Conservatives (best of them the so-called Christian Conservatives) and the best you may earn is a moan.\n\nTherefore we will have to do with what they give us, and when need is, we will supplement it by utilizing our own internationally operated infrastructure 🙂"
}
