{
    "author": "Andreas",
    "author_url": "",
    "date": "2008-08-24 20:01:00",
    "indent_level": 0,
    "content": "Ted, the \"extreme right\" that I talk about is the FPÖ, \"Freiheitliche Partei Österreichs\", normally translated to English as \"Freedom Party\". They are the \"far right\", because there is nothing right of them and they are by far more right than any other party. <br/><br/>Well, the last sentence is not exactly correct, because the FPÖ had a split in ... 2005? 2004? Anyway. Their former leader, Jörg Haider, a brilliant populist, maybe the most brilliant Austrian politician since Bruno Kreisky, split the party to quit with their financial debts, but his new party is generally regarded as \"more of the same\", thus my judgment is not so altogether wrong as it seems upon first sight. Yes, there are two right-wing populist parties now, but for all practical reasons they are the same and they may re-unite at any time.<br/><br/>The FPÖ began as VDU, \"Verband der Unabhängigen\", i.e. \"Union of the Independent\" right after the war. It was basically a party of former Nazi. There was always a liberal undercurrent, but it was never strong, and when the FPÖ went into a coalition with the SPÖ, the Social Democrats, in 1983, the protest of the FPÖ's nationalist wing was strong. This was the time of Jörg Haider's rise, and by 1984 he managed to turn over FPÖ leadership to him. The coalition broke and Haider began his populist war against the establishment.<br/><br/>Today Haider is \"Landeshauptmann\" in Carinthia, my home province, a function that's roughly equivalent to a governor in the US, and throughout his political career he has only called apon the worst in people: jealousy, greed and envy. Most of the time the victims were foreigners, asylum-seekers, and of course the Slovenian minority in Carinthia.<br/><br/>For me Jörg Haider and his imitators are the worst possible kind of politician. I don't even believe that he means what he says. I think he is after nothing but power, but in the time of his career he has managed to make the unspeakable speakable, to make the despicable estimable. Mephisto would be proud of his pupil.<br/><br/>So now, may I please call my Nazi \"Nazi\"? Thanks."
}
