{
    "id": "1613",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2007-08-12 08:33:00",
    "indent_level": 0,
    "content": "Ted,<br/><br/>Really, how concerned should you be? How concerned are you on the streets of New York City? People here in Europe are constantly warned about high crime rates in NYC and other big cities in the US. <br/><br/>I think two phenomenons apply. Media report crime and never the absence of crime. This is a well known amplification effect, and it alters not only our perception of reality, but unfortunately reality itself. An example is the completely warped image of asylum seekers from Africa. The Austrian boulevard press portraits them as drug dealers and criminals, the extreme political right plays on that instrument, both exert pressure on the government to make life for asylum seekers as inconvenient as possible, the government, like all governments always concerned about pleasing the masses, does so, denies the asylum seekers the right to work and forces many into illegal activities. And any actual incident of crime turns the spiral further. It's depressing, especially when it could be so easy to welcome those people, but instead they are made the objects of petty pseudo-politics, of substitute acts that help our politicians avoid doing their job and tackling the real problems.<br/><br/>The second phenomenon is, that I as a photographer am not very trustworthy as a source of information. I have a preference for the old and the weathered, the wounded and the neglected. Shiny new surfaces, neat and tidy places, they don't interest me half as much as the shabby corners. There is an organic quality in decay, something random and living, that makes it interesting to look into the details, that many times even creates the details in the first place. Graffiti are part of that.<br/><br/>Are graffiti more common in Austria than in the US? Or is the question if they are more common in Vienna, Austria than in Lancaster, Pennsylvania? Wikipedia claims a population of 55,351 for Lancaster, versus 1.7 million (2.2 million within the metropolitan area) for Vienna. I think you live in a wonderful, peaceful place and there are similar small cities like that in Austria, where you hardly see graffiti at all.<br/><br/>And Rome? Florence? Well, for Italian circumstances, Florence always reminds me of Switzerland. It's rich and tidy. Rome is a completely different beast. It is a bustling metropolis breathing life, and that is what makes it so incredibly interesting. Well, among more than 2000 years of architecture probably 🙂<br/><br/>There is certainly crime in Rome, but in the five times I've been there, a week each time, I have not seen anything. Well, that's not true. Once in a bus from Termini down to the Piazza Venezia, someone fidgeted around with my Rucksack. It must have been the most incompetent pickpocket in the world. I gave him a grave look, he gave me an embarrassed shrug, and that was it.<br/><br/>No, I feel safe in Italy. I still would not wear my wallet in my back pocket, but I don't do it anywhere. It's too much of an invitation. On the other hand, my father does, and he has never been robbed either, but I would rather play safe.<br/><br/>Andreas"
}
