{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2011-07-04 10:04:36",
    "indent_level": 1,
    "content": "Thanks.\n\nClearly the X100 has the bigger and better sensor. Its ISO 3200 is better than my ISO 400. That's an advantage of 3 or 3.5 stops. On the other hand, its lens is equivalent to 35 mm, and it is not stabilized. Let's say we can reliably hold 1/30s. The LX5 opens up to f2 as well, albeit only at 24 mm, but as we compare with a fixed length camera, this can't be counted against it. And even if we compare at 35 mm, the LX5 still goes to f2.3, which is no substantial difference. With the LX5 at 35 mm, I can pretty reliably hold 1/8s, and I regularly hold speeds down to 1/2s. That's everything between two and four stops, and as long as your subjects don't move or you like motion blur (both true for me), I can't see the X100 in a much better position. A stabilized sensor or lens on the X100 would make all the difference, but not as it is.\n\nThe X100 seems to have a fine lens, but so does the LX5. No difference either.\n\nWith its fixed focal length, the X100 may appeal to many enthusiasts, but it is also clearly less useful for general photography. On the LX5 I have a range of 24-90 mm plus the possibility to use the wide-angle adapter with a fixed 18 mm equivalent. This is clearly a plus for the LX5.\n\nOverall I think the X100 wins in image quality. Not by much, but it does, and the advantage of shooting with less motion blur certainly appeals to many people. The LX5 is definitely no action camera, but then, neither is the X100. I use the D300 for that.\n\nObviously the X100 offers shallow DOF and the LX5 does not. Bot can be an advantage, but in this regard I'd favor the X100.\n\nFor me the LX5 wins in versatility, and this time not slightly but by much.\n\nAround here the X100 is priced at 1000€ and still nobody can deliver, whereas the LX5 + EVF go for less than 600€ and are readily available. Clear win for the LX5.\n\nCoolness and beauty? X100, what else.\n\nAs I see it, as long as you are not a single-lens enthusiast with much love for retro design, you are much better off buying the LX5 or an Olympus Pen (ideally the E-P3 in August), if you want interchangeable lenses. For me the E-P3 or the E-PL3 (both not yet available) are the hottest cameras of the year. For the same price as the X100 you get a stabilized E-P3 with a 17/1.8 (34 mm equivalent). Even if its sensor quality were lower by one step (no idea, but let's assume it for the sake of the argument), it would win in pretty all departments. Heck, even the current E-P2 / E-PL2 are good choices and I would prefer them over the X100."
}
