{
    "id": "4622",
    "author": "Paul Maxim",
    "author_url": "http://paulmaximphotography.wordpress.com",
    "date": "2009-11-26 13:00:37",
    "indent_level": 0,
    "content": "God, I hope we don't get too tangled up in this discussion - as you know, it's a debate that's been going on nearly since the beginning of photographic time!  And once more, these happen to be my opinions.  I'm not trying to convert anyone.\n\nThe issue for me is \"content\".  Manipulating light with flash or changing certain colors or tones or inherent contrast in PS or Lightroom or even the darkroom is very much not the issue.  The issue (for me, at least) is the addition or subtraction of elements within the frame.  Let's say I'm on a one day visit to the Grand Canyon and would very much like to capture a spectacular sunset at Mather Point.  As sunset approaches, so do the clouds.  It's just yucky, flat gray light.  Not a problem!  I have a great sunset image back home in my computer.  I'll just swap out the sky from that image and put it into the Grand Canyon image.  Or maybe I do get the sunset image right there but I don't like all those people standing along the canyon edge.  One or two would create some nice visual balance, but 15 is too many.  Well, I'll just remove 13 or 14.  Who's going to know?\n\nThat's my \"problem\".  I don't give a damn if a photograph looks like it did \"in nature\".  That's the photographer's business.  But if you're going to add things that weren't there or subtract things that were, then I think you have an obligation to let me know.\n\nAs to whether or not that will diminish my estimate of the image's value, all I can say is that \"it depends\".  I'm a very big fan of Jerry Uelsmann's work.  Have been for a long time.  I can sit and look at his stuff for hours.  I love the recurring theme of the cupped hands, for example.  I love that he describes his work as \"reality that transcends surface reality\".  His images are, in my opinion, the best examples of compositing that you'll find anywhere.  So there is no hierarchy in my mind, as has been suggested.  \n\nBut Jerry Uelsmann never says, nor does he imply, that what you see is what he captured in a single frame.  It's understood by all - photographer and viewer(s) alike - that what you see is the result of combining elements from multiple sources.  \n\nTo me, that's very different from the person who proudly shows me a Grand Canyon sunset that never occurred.  And I disagree with those who say \"no harm, no foul\".  Call it artistic license if you want, but it's deceit.  So just own up to it.  You'll feel much better for \"coming clean\"............"
}
