{
    "id": "16344",
    "author": "Flo (tonebytone)",
    "author_url": "",
    "date": "2011-09-24 12:43:29",
    "indent_level": 0,
    "content": "Sure, the square would be useful - but surely one can eyeball a square within the viewfinder and compose accordingly, to crop in pp? More work, can't shoot off the cuff, so to speak. But hey, if the camera does everything else you want - \"don't throw out the baby with the bathwater\"!\n\n(The above quote dates from the 1400 or 1500s in England. When the weekly bath water was drawn, the head of household got first choice, followed by the rest of the males of the household. Then the women and children got to bathe in the now-dirty water. And finally, the poor babies were dipped into water that was sometimes so dirty you couldn't see through it. Hence the above saying came into play.)\n\nI have decided that, due to the bad economy, I'm buying only food, and fuel for my car. No clothing, except to replace shoes that wear out. No eating out - home cooking is healthier anyway. No going to movies, plays or shows - unless they're free. (There are so many choices on TV and the internet these days, who needs to leave home, except to get fresh air?) Which I plan to do frequently, as there are nice parks and other public places close to home.\n\nThe Fuji X100 was my last electronics purchase for a long long while. I'm mostly happy with it. But it's not fast, and its macro setting leaves a lot to be desired. The Nikon D300 with all the lenses I have will do everything else I'd want to do, photographically speaking - except no stabilization. These days I'm dealing with back and hip \"protests,\" so I don't lug a tripod, nor do I lug more than one lens, if I take the Nikon out. And so I adjust and adapt.\n\nIf the economy had to depend on people like me, it'd fall through completely, lol. But maybe that'd be a good thing, after all?\n\nOh yes, your image, lol! I love the point of view from which you shot this. A very nice abstract - and you do abstracts so well. Thank you for sharing."
}
