{
    "id": "65801",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2014-09-29 12:33:35",
    "indent_level": 1,
    "content": "Yes. Long ago we lost a war and our culture 🙂\n\nDon't get me wrong, I think it is exactly what \"we\" deserved, but that's what happens when a war is lost or for some other reason a culture gets dominated. It happened on many levels. \n\nFor my generation german music was highly suspicious. Today we see \"new folk music\" in german language or dialects, and it's not only the old Nazis who flock to it. Much to the contrary, I'd say. \n\nThe same happened with movies. All that is helped by the general concentration in content production. One of the best fantasy role playing games that I know of, Gothic, is by a geman development studio and it was originally developed in german language only. After the initial success they produced an english version - and it was awful. Today the studio produces for the international market, and that's English first.\n\nBut back to WW2. We did not only lose a war, we lost much of our intellectual elite, either because they were Jews, or because they just didn't want to live in a totalitarian nightmare. We also lost our scientists, the innocent who left because they needed to or wanted to, as well as the not so innocent who were hired by the US military. Look at medicine, chemistry or physics. The dominant language in those fields before WW2 was German, but today it is English. Russian played a role for a long time, but in the end the Russians lost the cold war or simply gave it up, and along with that, their language lost importance as well.\n\nYou really found English dominating even before the advent of the Internet, and of course global communication and globalization in general act as multiplicators. You also see the phenomenon in other languages. Just ask the French or the Spanish, but in their cultures the insistence on their own language is not coupled to the memory of a hideous crime. And even they struggle. Here in Austria/Germany there has not even been much effort to begin with, just because it was always suspicious and looked revisionist."
}
