{
    "id": "2916",
    "author": "Ted",
    "author_url": "",
    "date": "2009-03-15 15:51:00",
    "indent_level": 0,
    "content": "If I had taken the original image which Shepard appropriated almost in its entirety, I would sue his ass  sore. However, if Shepard had used that image to create a cultural context as you have done brilliantly here then I'd be quite pleased as the original artists that my work had become an allegorical necessity. Just Thursday I was confronted by a spectacular sculpture of Ghandi that sits in Washington, D.C. I tried to see if I could incorporate it in part or whole into an impression beyond the artist's. I took maybe five image and stopped. I could find no way that I could use it to say more about anything than the sculptor did. <br/><br/>Perhaps at some point in the future the meaning of Ghandi might enhance a broader idea I will have. At that point, my images might be resurrected to the compliment of this (unknown) artist. <br/><br/>Until then the public art adds nothing to my vocabulary. However, note many of your images which rely heavily upon the art of architecture. How do the differ from Shepard's use of the Obama image?<br/><br/>I think the answer, once again, has to do with context that is deliberately found to make clear either a sense of place, a deeply felt emotion, an cosmic idea... and the like. However, your images do not rely exclusively upon a base structure which you employ as sort of child's coloring book. That was Shepard's mistake. As a proud graffiti artist, Shepard has no respect for intellectual or artistic property. He continually acts as if the works and belongings are his to plunder. Some consider his piracy romantic. Okay... there's no accounting for the insensitivity we have for others as we attempt to justify our own greed.  <br/><br/>The AP photographer who took President Obama's picture is entitled to protect his property with the same zeal as you or me. I hope he does, and I hope he is successful. Rights are only those things which you can defend."
}
