{
    "id": "1900",
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2008-01-02 05:00:00",
    "indent_level": 0,
    "content": "Am I missing something? In the very recent past, tyrants marauded like the Four Horseman over the very ground you’ve pictured here. Until the 1700s the average annual income of the people living around that landscape was below the Roman Legion’s. And even if they had purchasing power, the choices of everything from food, clothing, housing … i.e. the essentials… to sex, drugs, and rock and roll were astonishing less. Today the average person living around that countryside… no, the poorest people living around that landscape, have many aspects of life that exceed the royalty of the 1800s. And I haven’t even mentioned health care, nutrition, and life expectancy (including the quality of  that lifetime).<br/><br/>Far from the desperation of the people of the 1920s-40s… the folks living around your pictured site – enjoy a rule of law, constitutional protections, and a security of mind greater than  any group their size in history. <br/><br/>Are there still large pockets of hopelessness? Yep. Is it smaller as a percentage of humanity than ever? Uh-huh. Are we tumbling downward? Not by any collective measurement I know of. Superstition is under attack everywhere (yes it’s fighting back, understandably… but perhaps for the first time in  history, it’s on the defensive). Is it inevitable that we will continue upon this vector of prosperity? Nope. But at least the time we live in is golden by every historical standard.<br/><br/>And yet we whine. Why? Because we haven’t lived during times of plague, dust bowls, heating, cooling, despotism, world wars, pestilence, or social and economic horror. Yeah, many still do. Can that be alleviated?  I don’t know. The jury is out on that. Especially since the most prosperous parts of the globe have virtually invented  their own psychological malaise.  Our children are fat and lazy – and it’s possible that we might go from shirt sleeves to shirt sleeves in three generations as a result of self indulgence, imagined hysterias, and incentive dysfunction. But… those are hardly the challenges which our grandparents faced. <br/><br/>The human situation is in pretty good shape. We can learn lessons from how this happened. We can also refuse to put those lessons into practice, or worse yet psychotically kill the golden goose. Regardless, we’ve got a glass in front of us that’s more than half full. That’s the good news as 2008 dawns. And it’s a damned good time to be a photographer. <br/><br/>Happy….<br/><br/>Ted"
}
