{
    "author": "ian_mac",
    "author_url": "",
    "date": "2007-03-26 17:52:00",
    "indent_level": 0,
    "content": "Oops, here is the book! I don,t normally comment on photos or what someone else says about them.  In case it matters, i came to this blog and Ted's via 'the Radiant Vista' which i just 'joined'. Perhaps it was Ted's thoughful post there on critiques that put me in this frame of mind?  I haven't gone through very much of either of your blog's though, so please forgive me if what i have to say has already been beaten to death.<br/>I, too, really, really like this image.  For me it is about the imperfect circle of life and death and joy and sadness.  Very powerful. <br/>But for me, I was happy to get some insight about this image. Maybe it is 'false' because i want to live vicariously through the photographer while i am captivated by this image? It may have a certain connection for me without this other connection but if i am greedy and needy then i want to have a connection with the photographer.  I want to share my emotion with the person who inspired it.  Reading Andreas' blog makes me feel that i have some sort of connection with him.  I now have to see this photograph from the point of someone that is sick and perhaps alone.  Wow, it really hits me emotionally now and my feeling for the image goes way-up. I can't control it, it just happens. Why did Andreas only 'see' this now?  I don,t think that i would feel as intensly about this image if I knew that it had been orchestrated.  I might then have a strong intellectual respect for the image (as i do now Ted for your 'construction' of your image of the 3 'houses') but my emotional response would be less. The initial positive reaction would be there but the deepening probably wouldn't happen.  I also don't think that this image would have had the same effect on me if I was 25, if i hadn't been married and divorced, if my mother was still alive, etc.. but that is something different.<br/><br/>So, I think, some space for self- reflection by the viewer is good  but I am normally happy to get some background from the artist afterwards perhaps especially when there is some element of serendipity involved.<br/>BTW, I hope you get well soon Andreas and thank you both for your blogs and participation at RadiantVista."
}
