{
    "id": "2383",
    "author": "Ted",
    "author_url": "",
    "date": "2008-08-28 03:21:00",
    "indent_level": 0,
    "content": "Some thoughts if you don't mind....<br/><br/>There are those who think that the camera is a pail that carries around whatever  we scoop up. It is incapable of invention, and therefore creativity. Photographers, these people argue, are plagarists of the moment. Many of those who think this way are photographers themselves who cart around a great big hunk of self doubt. <br/><br/>They argue that painters start with a blank plane and fill it with their personal meanings. Sculptors start with a block from which they unwrap an angel of their imagination. Poets, like painters, fill a surface with their imaginings. Ditto playrights, composers,  and poets. Meantime photographers start with a plane filled with whatever  they coincidentally aimed their lens. Or at least that’s the argument of those who equate cameras with buckets. <br/><br/>Meaning is difficult to hold as a moonbeam in your hand. It defines ephemeral. <br/><br/>The very technique of photography absolutely demands that the photographer imposes a subjectivity upon whatever  he photographs. Meaning? From the selection of point of view through whatever pre-processing he imposes… Which may be as complex as casting, building and assembling the subject (sets, wardrobe, makeup, direction, etc.),  and precisely arranging its disparate parts. But even if none of this is done – even if the subject is a spontaneous find there is the next round of pre-processing involving  the selection of lighting, filters, lenses, camera, aperture, speed, tripod, dropping, framing, film/sensor dimensions… film type,color balancing, sensor preprogramming, ISO… and on. All done before a shutter is fired.<br/><br/>And none of that involves post processing in any way. What it does do is fill a blank sensor or film plane. The photographer comes to a blank frame just as do all other artists. And he calculatingly fills it – with whatever meaning he creates or finds. But… to dismiss the power of digital post processing is like a hunter actually dismissing his prey. Because now, the photographic hunter can entirely define and describe that prey in any way that occurs to him. In whatever detail he can imagine. The final image in now entirely plastic. <br/><br/>It is questionable if the same picture can ever be replicated at another date, or by another artist. It is probable that photographers, unlike painters, cannot copy the masters. That photography is so subjective in its purpose and meaning, that it is not rebuildable (I avoid the word replicable only because we can make identical copies of the final digital images), <br/><br/>So, the meaning of photographic art is probably the most subjective of all. And while it might be possible to plagiarize a discovered moment, it is also easier in photography not to do that. It is actually harder for a painter to copy a moment HE THINKS he discovered than a photographer. <br/><br/>The only meaning then, that may have been sitting at a point awaiting a photographer to scoop into his pail, might be an already created work of art (sculpture, painting, etc.) which some photographer either through sloppiness, lack of creativity, or slavish intention… merely copies. Otherwise, virtually all photographic art embodies the artist’s meaning. Now whether it is worth conveying, or whether it is ambiguously impenetrable is another issue. <br/><br/>Because it has meaning, or is art, has little to do with whether it is any good. But that is another discussion of subjectivity versus objective truth, eh?"
}
