{
    "id": "2185",
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2008-05-29 10:49:00",
    "indent_level": 0,
    "content": "Tibor,<br/><br/>Thanks for your comment. I think you pointed out something very important here. <br/><br/>Blogging is never only for the others, it is always primarily for yourself. I suppose there are bloggers outside, who make a living by blogging, but the vast majority does not. They do it for the fun of it, to voice their opinions, to show off what they do, to communicate, to find friends and get inspiring input. It's an offer to the public. If it is taken, well, nice, if not, well, there is always room for improvement and adaption, but this should not be one's primary concern.<br/><br/>And there is quite some risk in blogging as well. You expose yourself. Every time. You expose your work, open it to public critique, even ridicule. Say something silly in public and it will quickly be forgotten. Do the same on the Internet and you face the memory of Google. Even if you pull an article, you have to live with the fact that Google has it in its caches.<br/><br/>As far as learning goes, yes, a personal instructor is fine, no doubt. Personally I wouldn't say that I have learned much technically from reading blogs. Yes, <a HREF=\"http://digitalprotalk.blogspot.com\" REL=\"nofollow\">David Ziser</a> has lots of interesting things to tell about using flashes, about events and people photography in general, and I follow his blog loosely, hoping that I will remember his tips when I'll be in one of those rare occasions to need them next time. <br/><br/>I get more out of being confronted with opinions, styles, etc. Let's for instance take your blog entry about your <a HREF=\"http://www.photonovice.net/2008/05/29/two-hours-in-a-studio/\" REL=\"nofollow\">recent </a>studio shooting. It is not a wealth of information that I'm thankful to have got and that I wouldn't have known how to carry on without, but, although I know the images, I didn't connect them to the name Platon. Now I do. Thank you for that."
}
