{
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2007-12-07 12:42:00",
    "indent_level": 0,
    "content": "Yeah, I shall weigh in on this at length on my blogsite sometime next week... but suffice it to say that for too many the line between style and stunt is invisible. <br/><br/>Regardless of what style is, creating it through the use of a filter, a lens, a palette, or another technical gee-gaw is, as you so succinctly put it, artistic death. <br/><br/>Question, how many of the \"great\" artistic photographers of the first 125 years of photography... how many of them can be identified by the examination of any randomly selected six from their not overly famous images? <br/><br/>I can name maybe three: Jerry Uselmann, Dina Arbus, and Duane Michaels (all of which may be misspelled... sorry). Certainly not Ansel Adams, Edward Stiechen, or Alfred Steiglitz (again my apologies to the dictionary). Certainly not Cartier-Bresson, Brett Weston, Eliot Porter, Eadweard Muybridge, or even Fox Talbot. <br/><br/>Is it the nature of photography to allow a creative person to become so dazzling expressive with each major addition to his/her portfolio that it is the subject rather than the auteur which always bleed through? Is it the nature of photography that unless the photographer is determinedly stunt oriented, that what an image is about will always overwhelm \"who took the picture\"?<br/><br/>There is a machine between a photographer and subject. To what degree will that mechanical apparatus always ... always... always... diminish the photographer's role in creation? Or at least restrict the photographer's ability to overwhelm the frame with personality? Remember, until this era of unlimited PP... Photographers were strictly governed by engineering standards that make genuine ideosyncratic achievement a rarity.<br/><br/>Right? <br/><br/>Is style in an image, or inherent in an entire body of lifelong work? And if the latter, how to explain the fact that it cannot be found in a random selection of any of the pieces of a life-time's portfolio?"
}
