{
    "author": "Flo",
    "author_url": "http://photos.tonebytone.com",
    "date": "2009-12-07 14:16:58",
    "indent_level": 0,
    "content": "Andreas, it's very interesting to me that you have so far received no responses to this particular post. I didn't get here yesterday and perhaps not the day before. But if this is today's (Monday, Dec 7) post, then perhaps some people are at work and haven't had time to come here and comment yet.\n\nRecently April and Usha have started their own blogs. April kept her's up faithfully every day for the 30 days of November. But since the ned of Nov, April hasn't posted anything else. To me as a viewer, this is disappointing, as her work is so incredibly interesting and enjoyable. But I know she's bust and didn't promise to post daily any more.\n\nUsha so far has only one post to her blog. And this is disappointing, too, for I consider Usha to be a great and constantly developing photographer, especialy of people.\n\nYou wrote: \"Then why do I do it?\n\n\"I think a part of the answer lies in my desire to communicate with people who are interested in the same things that I am interested in. Or variations thereof. The problem is, you can’t communicate with yourself only. You need an audience. It’s the first hurdle that every blog has to overcome.\"\n\nI too love to communicate. Which is what I try to do when I post images to The Mindful Eye's forum. But few people respond to my images, so I know enough not to try to start a blog. It would be a mostly fruitless endeavor.\n\nSome people, like Roland, Wes, April, Usha, Ted and certain others can always count on getting at least a few responses. When you used to post at the now-closed Radiant Vista forum, people would respond to your images, too. If you came back (to the TME forum), you also would get responses.\n\nSome people - you and those I listed above - have a knack for making your captures appeal to a wide range of viewers. This is your talent. I still seem to be stuck at the picture postcard level, no matter how many workshop and classes I've taken. So this is my lack of talent. In spite of what Craig says in his article \"The Myth of Talent.\"\n\nSo, bottom line: people who can make images that appeal to a variety of viewers are those who will also succeed with blogging. Those who don't make images that appeal, will not succeed with blogging.\n\nI love your image - at first I thought it was of the ocean! But when I viewed the larger size, then i could see that what I'd thought were waves are really little mounds and puffs of snow (in the foreground). The line of trees in the distance plus the darker hills/mountains I thought were the distant shoreline. It's a lovely and very intriguing image."
}
