{
    "author": "andreas",
    "author_url": "https://manessinger.com/",
    "date": "2010-04-18 23:43:05",
    "indent_level": 0,
    "content": "Glad you like it. It's nothing special compositionally and flowers are such a cliché, but sometimes there is more to a picture than just the question whether it's art or not. This one simply made my day 🙂\n\nAs to the quality of blur at minimum focus distance (i.e. the minimum distance the lens will focus): In general depth of field is dependent on aperture, focal length and distance from subject to camera, or to be precise, to that point that is exactly the real focal length behind the front element of the lens.\n\nMost lenses bend and twist the light rays in kinds that make them longer than their focal length. A typical example are 10mm wide-angles for APS C-sized sensors. It's impossible to build such a short lens for a DSLR, thus they build it longer, typically between 70 and 100 mm, and construct it such that the light gets focused, bundled and sent straight backwards. It's more complex, but it's about equivalent to that. Thus effective subject distance of a 10 mm lens is from the subject to a point 10 mm behind the front element of the lens.\n\nThe shorter subject distance is in relation to focal length, the smaller is depth of field. Longer lenses with short minimum focus distances are best for that, the extreme is a macro lens, typically between 50 and 200 mm, frequently focusing down to an inch.\n\nThe second important variable is aperture. The wider it is, the more blur do you get in out-of-focus areas.\n\nThe third point is the relation of focus distance to the distance of out-of-focus areas. Focusing near with a far-off background gives you a better blur than focusing near with an only slightly more distant background.\n\nAll that does not say much about the absolute quality of the blur, i.e. how pleasant it looks. The more glass you have (number of elements in a lens), the bigger the zoom range (if it's a zoom), the cheaper the lens, the more compromises. Especially when you use a lens in its extremes, i.e. widest aperture, nearest focus distance, there is the potential for anomalies in the way the lens blurs out-of-focus areas. You may see double lines, onion effects on lights, etc, but usually when you get near to the subject and away from the background, the influence of subject distance to background distance ratio gets dominant. You may get a satisfying blur even on an otherwise mediocre lens. In this image I had exactly that condition. The flower was near, the background flowers relatively far off in relation to how near the subject was.\n\nSome links to read: <a target=\"_blank\" href=\"http://theonlinephotographer.typepad.com/the_online_photographer/2009/06/depth-of-field-hellthe-sequel.html\" rel=\"nofollow\">Ctein on depth of field</a> and <a target=\"_blank\" href=\"http://theonlinephotographer.typepad.com/the_online_photographer/2009/01/what-is-bokeh.html\" rel=\"nofollow\">Mike Johnston on Bokeh</a>."
}
