{
    "id": "67489",
    "author": "jj",
    "author_url": "",
    "date": "2016-02-26 03:39:07",
    "indent_level": 0,
    "content": "Here are links in regard to the bank situation and the \"erased\" from wikipedia, which I think downplays and excuses it to a fair degree: \nhttps://en.wikipedia.org/wiki/Ljubljana_Bank\nhttps://en.wikipedia.org/wiki/The_Erased\n\nAlso, Serbs do have a church there which was built in the 1930's called Sts. Cyril and Methodius Church https://en.wikipedia.org/wiki/Sts._Cyril_and_Methodius_Church_(Ljubljana)\n\nThis is a photo of it: http://s11.postimg.org/bj3nikyqb/DSC_2159.jpg\n\nAlso, according to Wikipedia, Serbs are 1.98% of Slovenia's population today, which is small, yet makes them the largest minority.\nhttps://en.wikipedia.org/wiki/Serbs_in_Slovenia\nSerbs in Slovenia are, by large, first or second generation immigrants from other republics of former Yugoslavia. In the 2002 census, 38,964 people of Slovenia declared Serb ethnicity, corresponding to 1.98% of the total population, making them the largest ethnic minority in the country.\n\nAnd there are some Serbs whose ancestors arrived in Slovenia much, much, much earlier as refugees fleeing the Ottomans. They are called \"Serbs of White Carniola\" but they have slowly become more and more assimilated.\nhttps://en.wikipedia.org/wiki/Serbs_of_White_Carniola\nApart from the immigrant community that makes up the vast majority of Serbs in Slovenia, there are a few villages in the southern region of White Carniola inhabited by descendants of Serbs that fled from the Ottoman Empire in the 16th century, beginning in 1528 and permanent by 1593. These immigrants founded settlements in which descendants of Serbs live to these days: Bojanci, Marindol, Paunovi?i, Adleši?i, Žuni?i, Mili?i and others. The majority of the community (Slovene: Srbi v Beli krajini) have kept the Serbian Orthodox faith and their distinctive culture, although they have been almost completely assimilated to their Slovene-speaking environment. Some of them became Uniate (Eastern Catholic) in the 17th and 18th century."
}
