{
    "id": "59467",
    "author": "Juha Haataja",
    "author_url": "http://lightscrape.blogspot.fi/",
    "date": "2013-07-16 08:29:42",
    "indent_level": 0,
    "content": "The topic of \"the sharpest pencil\" got me thinking... \n\nEU just put out a press release <a href=\"http://europa.eu/rapid/press-release_IP-13-678_en.htm\" rel=\"nofollow\">pondering</a> the future of higher education, containing this: \"Overall, the number of higher education students in the world is expected to quadruple, from around 100 million in 2000 to 400 million in 2030, with particularly strong growth in Asia and Latin America.\"\n\nWhen countries in Asia, Latin America etc. are pushing for higher education, that means that these countries are going to attract talent, and what happens then to countries such as USA, where the education system is struggling or even failing? If a country becomes a nation of incompetents, what is there left to do?\n\nAlso, I just read the book <i>Jennifer Government</i>, which originally appeared in 2003, and a rather sharp tale it was. Here is <a href=\"http://en.wikipedia.org/wiki/Jennifer_Government\" rel=\"nofollow\">a quote</a> from Wikipedia: \"The novel is set in a dystopian alternate reality in which most nations (now controlled by the United States) are dominated by for-profit corporate entities while the government's political power is extremely limited.\"\n\nThe plot is rather hilarious: \"Hack, a low level employee at Nike, is contracted by one of his higher ups, John Nike, Vice President of Guerrilla Marketing, for an ambitious marketing campaign. The company is planning to release the new Nike Mercurys […] and in order to drum up interest in the items, John Nike plans to increase \"street cred\" […] by having Hack kill people who try to buy them. Hack, bound by his contract but unable to contemplate murder on his own, subcontracts to the Police, now a mercenary organization […]\"\n\nWell, if we combine these two things, the lack of motivation for getting education, and a libertarian approach to the government, we can envision a future where a country tries to maintain its power by any means available, joining forces with huge private enterprises, spying on all the other nations (and foreign enterprises), while being criticized increasingly hard, losing credibility, and thus ending in a spiral of doom, lacking any way out of the increasingly bad situation."
}
