{
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2007-03-10 12:56:00",
    "indent_level": 0,
    "content": "Once upon a time I studied economics at University Park, home of Penn State where a utopian invented “Blue Bikes” a program that spread hundreds, maybe  thousands, of shiny bicycles all over campus at convenient racks where they were free to any user. You mounted up, rode one wherever, and left it at the nearest available rack. <br/><br/>And it taught me a couple of important lessons in economics. First off: and absolutely the most important… When you give something away,  sooner or later people will figure that’s what  it’s worth! People treat things which are given to them, as if they have no value.<br/><br/>Within days tires were slashed, bikes were  horribly bent, seats ripped, chains broken and gone. Students rode them down stairways, off of rocks, out of windows. Drunken revelers held jousting parties. Rooftop bike tossing competitions were announced. Fraternities and sororities used them in pools and lakes. Many took one home when they left campus. Visitors grabbed them as souvenirs. Townspeople from surrounding villages trucked them off – “Why not?” They argued – these were  taxpayer purchased and they too paid taxes. Soon only bike skeletons sat at racks where they’d been stripped for parts to keep the smaller remaining amount of still usable bikes going. And those were hoarded in dormitory rooms, or in secret places. Faculty members drove them home and gave them to their children. Bike locks appeared, chaining some few working machines to racks – so they’d be available to their ‘owners’ when they returned from class.  Bikes became weapons of social protest, thrown through windows or jammed into stairwells to intentionally impede traffic. <br/><br/>Student artists began to cut them up and display their parts as the “Sculpture of The People”. They appeared as street displays done by the self indulgent of the left who felt that they could both communicate their rage and simultaneously impose a modicum of discomfort upon the majority to highlight some Cause Du Jure. Other activists piled them into vans to be redistributed to bike-less people in Philadelphia and Pittsburg. Oh, and by the way, formally prosperous bicycle shops closed down, unemploying their workers and ruining their owners. <br/><br/>And the second economic lesson? The down-f all of utopia is human nature. People do not long for an “equitable” or “fair” distribution of scarce resources… they yearn instead to distribute all resources toward themselves. Without some rationing device, say ‘price’, reinforced by the full power the state to enforce some concept of private property – or worth  - upon things, a significant percentage of the population will redistribute everything toward themselves. Self-indulgence of the few will always redistribute scarce things away from the good-nature of the many. <br/><br/>Just as the conservative fault lies in a lack of compassion, the liberal fault line is a romantic belief in human nature. Those are the tectonic plates of our great ideologies. They have smashed up against one another for tens of thousands of years. And as I watched  those smashings gnarl the Blue Bikes… I lost my ideological innocence and graduated from both liberalism and conservatism into cynicism. Once upon a time…"
}
