{
    "id": "15439",
    "author": "Flo (tonebytone)",
    "author_url": "",
    "date": "2011-09-11 15:03:54",
    "indent_level": 0,
    "content": "Well, guys, I do respect your right to believe as you choose. But I do agree with all of you that neither atheists nor religious sorts have the right to force their beliefs down other people's throats.\n\nWhen I was a kid, I got so confused because all the \"experts\" at church couldn't tell me to my satisfaction and understanding what God is. I finally decided, after a course in comparative religions, that there's a kernel of truth that is common to all the major - and many minor faiths - that we could consider to be the basic fabric. But each religious and belief system has embroidered its own designs using its own colors and threads so tightly onto the fabric that we can no longer discern the basic fabric - which I'll call Life.\n\nLet me tell you a story that may restore your faith in the possibility of life after death. My late husband was in the hospital on death's bed when the doctors finally decided to start chemo. They told us to go home and that they'd call the next morning to let us know whether the chemo worked.\n\nWell, next morning at 9:30 the doc called and said the chemo didn't work - I hadn't expected it to as they'ed waited so long - and that the decision about what to do was up to me. Did I want to keep his body on life support or did I want them to pull the plug. I had no problem with this decision - pull the plug.\n\nAn hour and 50 minutes later, while I was emailing friends and relatives, suddenly I was aware that my husband was standing to my left! As soon as he got my attention, he asked - telepathically, whether I appreciated all the ways in which he'd supported me throughout our marriage. I knew what he meant, that he'd made a pre-birth agreement with me that he would support me financially and psychologically in whatever spiritual endeavors I would choose. I told him, \"Yes, of course!\" And poof - he was gone.\n\nThis made me very happy, as I knew then that not only had he remembered our pre-birth agreement, but he also knew after he left his physical body, to go into the Light. He wouldn't get stuck near the physical plane. Since he'd never been interested in anything having to do with spirituality or the lack thereof, I'd been concerned that he might hang around as a ghost and hount us!\n\nHere's what I believe: We are eternal souls who choose to incarnate as physical beings from time to time ion various physical places, to learn certain lessons. This earth is a great school for all kinds of learning. \n\nWhen we're finished with the tasks, lessons and challenges we've set up for ourselves to experience in this physical lifetime, then we leave our physical bodies - this is called death - and move on to the next level of experiencing and learning. We have free will to do these things. No one is going to tell us what to do, except out cumulative soul which is the sum total of all our/its aggregate experiences both in and beyond the physical.\n\nBefore we decide to incarnate again, we make agreements and arrangements with others that we'll interact with during our physical incarnations. This is what my husband and I had agreed to do - meet each other and get married and raise kids. He would support me while I explored spirituality - as opposed to being \"religious\". I'd suspected for several years prior to his death that we'd made this kind of agreement. But I couldn't talk to him about it, as he just plain wasn't interested.\n\nNow, who set all this up? Well, I believe that there is a Source or Creator of all that is, has been, and will be. It doesn't matter what we choose to call this Source. And we even have free will not to believe in the existence of this Source!\n\nAnd I also believe that we'll find out much more about this subject when we drop our physical bodies. As long as we're occupying a physical body, we're limited in what we can perceive.\n\nSorry this got so long. But - hey, Andreas, you started it, lol!\n\nHugs,\nFlo"
}
