{
    "author": "Ted Byrne",
    "author_url": "",
    "date": "2007-12-29 21:56:00",
    "indent_level": 0,
    "content": "Mrs. Bhuto was brave, if like the rest of us, she feared death.  I have a suspicion that fear was to her, underdeveloped. Or she was foolhardy. If the latter then everything she presented is suspect since it would, of necessity be coming from someone who was less than connected to reality. <br/><br/>I'm guessing that her obsessions over came her natural instinct to cringe in the face of fanaticism. In fact, Mrs. Bhuto must have been as insensitive to the finality of death as the suicide fanatic who killed her. <br/><br/>Such a degree of disconnect with the death-terror which constrain the rest of us demands some serious thought from people who think about such things. I'd like to know what overwhelms that primal fear to the degree that these two people in this case met in a way that most of the rest of us could have predicted. <br/><br/>In the great nurture/nature struggle we're told that it is nurture which wins out - we're told that so we will believe in the supremacy of free will, and our own role in determining our destiny. And yet we have two people here, Mrs. Bhuto and her assassin, each who appear to have a natural ability to resist the promise of certain death.. or if not to resist it... to ignore it. Is that a genetic thing? Are they \"less terrified\" than the rest of us (I find it difficult to say \"Braver\" since that word implies a moral judgement)? Or has nurturing numbed their instinctive fear of dying? <br/><br/>If there are people with dysfunctional self-preservation instincts... then there is no hope of ever ending this sort of violent acceleration of passion. But if the muffling of terror comes from culture, then it is time to become judgmental with respect to cultures. And to either contain, constrain, or annihilate those which numb the natural warnings. <br/><br/>But that means the annihilators must become what they are motivated to annihilate. <br/><br/>Which presents us with perhaps the most challenging conundrum of all, eh?"
}
