{
    "author": "Ted",
    "author_url": "",
    "date": "2009-07-26 21:17:57",
    "indent_level": 0,
    "content": "My friend Reed Dixon is an artist who works in mixed media - mostly. His fine art work is immediately recognizable as his. Not as a matter of content, or media... but as a matter of execution. I asked him once when he settled upon a style... He seemed genuinely puzzled, &quot;What style?&quot; he wondered. And since I could not put into words the elements which clearly differentiate him from others - I let it drop. <br /><br />My friend Joe is a jazz pianist. Give me two minutes of tape, and I will pick him out of any number of samples. Is it safe to say that any three random movie <i>stars</i> are instantly recognizable regardless of how different the roles they are challenged by might be? There is a reason why we look forward to new Hamlets with each new generation. What about playwrights? I can tell Tennessee Williams from Edward Albee and both of them from Beckett. <br /><br />Don&#39;t even start me on composers, sculptors, novelists, poets,directors, or dancers. Hmmmm... so you argue that art photography is the only ART... the only one... where an artist&#39;s voice <i>cannot</i> grow sufficiently ideosincratic to communicate ideas/feelings valuably? <br /><br />Okay... I understand that there are photographers who have settled on a topic within  genre ... or who have finalized on a palette or technique that characterizes their work. But that assumes that style is mechanical (or defined by a phylum). Something that is NOT true of the unique voices of artistic COMMUNICATION in every other field of creativity.<br /><br />If it is true it questions, I think, whether photography is an art form or in reality little more than a craft. Except there are craftspersons who are defined by style. Is photography even less than that? <br /><br />It&#39;s a puzzlement, this corner you have pained yourself into here. <br /><br />Um... surprise... we do disagree here... Heh heh heh...."
}
