{
    "id": "66205",
    "author": "Cedric Canard",
    "author_url": "http://aplop.wordpress.com/",
    "date": "2014-11-26 11:28:03",
    "indent_level": 0,
    "content": "I like those photos by Christian Brandstätter. They are engaging in a very warm and friendly manner if that makes sense. Thanks for the link.\n\nI was fascinated with your observation connecting memories of a place with whether you took photos of it. You say that you remember a place better because you took time to see and compose photographs and not just because you have the photos to jog your memory.\n\nIn my experience I would agree that those places where I did not use a camera are rather vague to me. My recollection of them is mostly hazy. Those places where I did shoot are without a doubt sharper in my recollection however, unlike you, I believe it is precisely because the photos are there to help my memory and not because I took the time to compose shots. The reason I say this is because many years ago I travelled for many months around Great Britain/Ireland, visiting Scotland, Ireland, England and Wales. I took many photos of each country but on our return to Australia I lost all the Ireland photos. Both the prints and the negatives. I can say that my memory of Ireland faded much more quickly than my memory of the other places I visited around that period. Many years later the photos were found (through sheer luck) and I was extremely surprised to find that what memories of Ireland I had were not only hazy but completely wrong, or at least not aligned with the photos in terms of time sequence, weather, colours, places etc. And the few photos that I did remember making were not as good as I remembered them which felt a little embarrassing.\n\nAdmittedly, this is a purely anecdotal instance but I thought I'd share it. I think photos definitely help us remember things more clearly but that the <i>act</i> of photographing in itself does little to help. At least for me. Either way however, I do not trust memories."
}
